<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"edc40708c0715d19b156254ac1f9610c8f568e5683b7e882d318dc221e2fe6b0","plan_job_ref":"Job Run Terraform plan in staging #258 at https://github.com/GSA-TTS/continuous-assessment-poc/actions/runs/14931916509","plan_out_hash":"1529b0e4a7fea9decef94c349c8b4c4702e1cbc751babcf1680cb52a3bf06062","plan_hash":"65e4f87d40d574c4f9681d8d7a39a926fe9d81468d5b877221b340eb3f9fb493","plan_text_format":"diff","version":"1.48.0"} -->
Terraform plan in __terraform__
With var files: `terraform/staging.tfvars`
<details>
<summary>Plan: 0 to add, 3 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # cloudfoundry_app.app will be updated in-place
!~  resource "cloudfoundry_app" "app" {
!~      created_at                  = "2025-05-05T21:44:14Z" -> (known after apply)
+       disk_quota                  = (known after apply)
+       health_check_type           = (known after apply)
!~      id                          = "************************************" -> (known after apply)
+       instances                   = (known after apply)
+       log_rate_limit_per_second   = (known after apply)
+       memory                      = (known after apply)
        name                        = "continuous_monitoring-staging"
+       readiness_health_check_type = (known after apply)
!~      routes                      = [
-           {
-               protocol = "http1" -> null
-               route    = "continuous_monitoring-staging.app.cloud.gov" -> null
            },
        ] -> (known after apply)
!~      source_code_hash            = "vMSLn2qR+aTHm3taK0p54N64rmp1GZC2kBUIaVOoT30=" -> "Ue+C1SddeEFgat37C/2UtPSA3XrQLB1PR6UZRkUAct0="
!~      stack                       = "cflinuxfs4" -> (known after apply)
!~      updated_at                  = "2025-05-07T22:21:55Z" -> (known after apply)
#        (9 unchanged attributes hidden)
    }

  # cloudfoundry_network_policy.egress_routing will be updated in-place
!~  resource "cloudfoundry_network_policy" "egress_routing" {
!~      policies = [
!~          {
!~              source_app      = "0ed3cb39-41d8-43d9-be32-fb12f7ac0e1b" -> (known after apply)
#                (3 unchanged attributes hidden)
            },
!~          {
!~              source_app      = "0ed3cb39-41d8-43d9-be32-fb12f7ac0e1b" -> (known after apply)
#                (3 unchanged attributes hidden)
            },
        ]
    }

  # module.app_route[0].cloudfoundry_route.app_route will be updated in-place
!~  resource "cloudfoundry_route" "app_route" {
!~      destinations = [
-           {
-               app_id           = "0ed3cb39-41d8-43d9-be32-fb12f7ac0e1b" -> null
-               app_process_type = "web" -> null
-               id               = "af32b47f-3068-43a9-b31a-498745b66b7f" -> null
-               port             = 8080 -> null
-               protocol         = "http1" -> null
            },
+           {
+               app_id           = (known after apply)
+               app_process_type = (known after apply)
+               id               = (known after apply)
+               port             = (known after apply)
+               protocol         = (known after apply)
            },
        ]
        id           = "6a4244b6-9b21-4eba-ad87-4b324d5d984e"
!~      updated_at   = "2025-05-05T21:46:17Z" -> (known after apply)
#        (6 unchanged attributes hidden)
    }

Plan: 0 to add, 3 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Run Terraform plan in staging #258](https://github.com/GSA-TTS/continuous-assessment-poc/actions/runs/14931916509)